controllers/PazienteController.php

SELECT * FROM `paziente` WHERE `IdPaziente`='9'
---
    protected function findModel($IdPaziente)
    {
        if (($model = Paziente::findOne(['IdPaziente' => $IdPaziente])) !== null) {