controllers/PrenotazioneController.php

    public function actionCreate()
    {
        $model = new Prenotazione();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `prenotazione` (`IdLogopedista`, `IdCaregiver`, `data`) VALUES (3, 2, '2022-06-07')

    protected function findModel($ID)
    {
        if (($model = Prenotazione::findOne(['ID' => $ID])) !== null) {
---
SELECT * FROM `prenotazione` WHERE `ID`='6'