controllers/SvolgeesercizioController.php

    protected function findModel($ID)
    {
        if (($model = Svolgeesercizio::findOne(['ID' => $ID])) !== null) {
---
SELECT * FROM `svolgeesercizio` WHERE `ID`='6'