controllers/UserController.php

    protected function findModel($IdUser)
    {
        if (($model = user::findOne(['IdUser' => $IdUser])) !== null) {
---
SELECT * FROM `user` WHERE `IdUser`='3'