controllers/ValutaesercizioController.php

    public function actionCreate()
    {
        $model = new Valutaesercizio();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `valutaesercizio` (`IdEsercizio`, `valutazione`, `IdCaregiver`) VALUES (13, 5, 2)