controllers/ValutasvoltoController.php

    public function actionGetImg($es)
    {
        $svolto = Svolgeesercizio::findOne($es);
---
SELECT * FROM `svolgeesercizio` WHERE `ID`='6'

    public function actionCreate()
    {
        $model = new Valutasvolto();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `valutasvolto` (`IdSvolto`, `valutazione`, `IdLogoP`) VALUES (6, 75, 3)

    protected function findModel($ID)
    {
        if (($model = Valutasvolto::findOne(['ID' => $ID])) !== null) {
---
SELECT * FROM `valutasvolto` WHERE `ID`='5'