models/Assegnaesercizio.php

SELECT `IdPaziente` FROM `paziente` WHERE `IdCaregiver`=2
SELECT `IdEsercizio` FROM `assegnaesercizio` WHERE `IdPaziente`=9
---
    public static function findMyesercizio()
    {
        $user = Yii::$app->user->identity;
        $id = $user->getId();
        $i = 0;
        $rows = (new \yii\db\Query())
        ->select(['IdPaziente'])
        ->from('paziente')
        ->where(['IdCaregiver' => $id])
        ->all();
        foreach($rows as $result) {
            $idp[$i] = $result['IdPaziente'];
            $i++;
        }

        $i = 0;
        $rows = (new \yii\db\Query())
        ->select(['IdEsercizio'])
        ->from('assegnaesercizio')
        ->where(['IdPaziente' => $idp])
        ->all();
        foreach($rows as $result) {
            $ide[$i] = $result['IdEsercizio'];
            $i++;
        }



        return Assegnaesercizio::find()->where(['IdEsercizio' =>$ide]);