models/Esercizio.php

SELECT `valutazione` FROM `valutaesercizio` WHERE `IdEsercizio`=13
---
    public function getValutazione()
    {
        $id = $this ->IdEsercizio;
        $somma = 0;
        $count = 0;
        $rows = (new \yii\db\Query())
        ->select(['valutazione'])
        ->from('valutaesercizio')
        ->where(['IdEsercizio' => $id])
        ->all();

SELECT `IdPaziente` FROM `paziente` WHERE `IdCaregiver`=2
SELECT `IdEsercizio` FROM `svolgeesercizio` WHERE `IdPaziete`=9
SELECT * FROM `esercizio` WHERE (`IdEsercizio` NOT IN (SELECT `IdEsercizio` FROM `valutaesercizio` WHERE `IdEsercizio`=13)) AND (`IdEsercizio`=13)
---
    public static function findMyEsercizioSvolto()
    {
        $user = Yii::$app->user->identity;
        $id = $user->getId();
        $somma = 0;
        $count = 0;

        $rows = (new \yii\db\Query())
        ->select(['IdPaziente'])
        ->from('paziente')
        ->where(['IdCaregiver' => $id])
        ->all();
        foreach($rows as $result) {
            $idpaziente[$somma] = $result['IdPaziente'];
            $somma ++;
        }

        $rows = (new \yii\db\Query())
        ->select(['IdEsercizio'])
        ->from('svolgeesercizio')
        ->where(['IdPaziete' => $idpaziente])
        ->all();
        foreach($rows as $result) {
            $idesercizio[$count] = $result['IdEsercizio'];
            $count++;
            }
            $subQuery = Valutaesercizio::find()->select(['IdEsercizio'])->where(['IdEsercizio' => $idesercizio]); //fetch the customers whos posts are inactive - subquery
        return Esercizio::find()->andwhere(['NOT IN','IdEsercizio', $subQuery])->andWhere(['IdEsercizio'=>$idesercizio])->all();