models/Paziente.php

SELECT `ID` FROM `svolgeesercizio` WHERE `IdPaziete`=9
SELECT `valutazione` FROM `valutasvolto` WHERE `IdSvolto`=0
---
    public function getLivello()
    {
        $id = $this ->IdPaziente;
        $somma = 0;
        $count = 0;
        $idsvolto = 0;
        $rows = (new \yii\db\Query())
        ->select(['ID'])
        ->from('svolgeesercizio')
        ->where(['IdPaziete' => $id])
        ->all();
        foreach($rows as $result) {
            $idsvolto = $result['ID'];
            $count ++;
        }

        $count = 0;
        $rows = (new \yii\db\Query())
        ->select(['valutazione'])
        ->from('valutasvolto')
        ->where(['IdSvolto' => $idsvolto])
        ->all();