models/SvolgeesercizioSearch.php

    public function search($params)
    {
        $user = Yii::$app->user->identity;
        $id = $user->getId();
        $somma = 0;
        $rows = (new \yii\db\Query())
        ->select(['IdPaziente'])
        ->from('Paziente')
        ->where(['IdCaregiver' => $id])
        ->all();
---
SELECT `IdPaziente` FROM `Paziente` WHERE `IdCaregiver`=2