models/Svolgeesercizio.php

INSERT INTO `svolgeesercizio` (`IdPaziete`, `IdEsercizio`, `audio`) VALUES (9, 13, '/audio/frfGLyxtdYARJA7eA-kS2PhAhEtqvMz0/mpthreetest.mp3')
---
    public function save($runValidation = true, $attributeNames = null)
    {

        if ($this->audioFile) {
            $this->audio = '/audio/' . Yii::$app->security->generateRandomString() . '/' . $this->audioFile->name;
        }

        $transaction = Yii::$app->db->beginTransaction();
        $ok = parent::save($runValidation, $attributeNames);

        if ($ok && $this->audioFile) {
            $fullPath = Yii::getAlias('@app/web/uploads' . $this->audio);
            $dir = dirname($fullPath);
            if (!FileHelper::createDirectory($dir) | !$this->audioFile->saveAs($fullPath)) {