models/User.php

SELECT * FROM `user` WHERE `IdUser`=2
---
    public static function findIdentity($IdUser)
    {
        return self::findOne($IdUser);

SELECT * FROM `user` WHERE `email`='ginonominale@gmail.com'
---
    public static function findByEmail($email)
    {
        return self::findOne(['email'=>$email]);